/* alert("Текст повідомлення") - функція, 
яка вимагає в браузера показати повідомлення, 
вміст якого отримує у якості параметра - 
в круглих дужках */

// Текст повідомлення - не обов'язковий параметр,
// тобто можна не вказувати, але () - обов'язкові
//
// Підказка редактора коду:
// function alert(message?: any): void
//
// де function - тип об'єкта, вказує на функцію,
// тобто таку сутність, яка виконує певні операції
// і/або повертає результат, може приймати вхідні дані
// у вигляді параметрів або ні
//
// alert - назва функції, за допомогою якої відбувається
// виклик для виконання. Майже завжди супроводжується ()
//
// message? - параметр, за допомогою якого передається
// значення, яке потрібно показати. Це може бути текст,
// число або інший тип даних. Символ "?" означає, що
// параметр не є обов'язвим, тобто його можна не вказати
//
// ": void" - означає, що функція просто щось робить,
// але не повертає жодного значення
alert("Hello, world!");

// Виклик функції без параметра
// Результат - порожнє діалогове вікно
alert();

// Діалогове вікно з цифрою 5
alert(5);

// Браузер виконує JS-скрипт зверху до низу
// alert() блокує виконання скрипта до втручання користувача
// для зручнішого виведення інформації на екран
// будемо використовувати console.log()

// Підказка редактора коду:
// (method) Console.log(...data: any[]): void
//
// де (method) - аналог function, підказує,
// що маємо справу з функцією, тобто сутністю,
// яка виконує певні операції і/або повертає результат,
// може приймати вхідні дані у вигляді параметрів
//
// Console.log - назва методу. Майже завжди супроводжується ()
//
// "...data: any[]" - ознака того, метод (функція)
// може приймати будь-яку кількість парметрів
// будь-якого типу, але вони мають бути розділені ","
//
// ": void" - означає, що метод (функція) щось робить,
// але не повертає жодного значення
console.log();

// Скорочений спосіб виклику методу console.log():
// 1. Ввести "log"
// 2. Вибрати з підказки пункт з символом схожим на "П"
//    і написом "Log to the console"
//    (за звичай - 2-й у списку)
console.log(25); // 25 у консолі браузера
console.log(1, 2, 3, 4, 5); // кілька значень, розділених комою у консолі браузера
console.log("1,2,3,4,5"); // рядок у консолі браузера
console.log("Вівторок", "07", 7, 2026); // кілька значень різного типу розділених ","
