for (let i = 0; i < 5; i++) {
  // Початок блоку коду (тіла циклу)
  console.log(i);
  // Кінець блоку коду (тіла циклу)
}

// Оголошуємо змінну i та присвоюємо їй значення 0
// Задаємо умову виходу з циклу i < 5
// - Будемо повторювати блок коду (тіло циклу) поки умова істинна
// - Якщо умова хибна - завершуємо роботу циклу або не починаємо
// Виконуємо тіло циклу
// Збільшуємо значення змінної i на 1 (i++ - це i = i + 1 або i += 1)
// Перевіряємо умову
// і т.д.

console.log("-------------------");

for (let i = 1; i <= 5; i += 1) {
  console.log(i);
}

console.log("-------------------");

for (let i = 3; i < 20; i = i + 3) {
  console.log(i);
}

console.log("-------------------");

console.log("Приклад роботи циклу for, якщо умова не виконується");

for (let j = 40; j < 10; j += 1) {
  console.log(j);
}

console.log("Кінець прикладу роботи циклу for, якщо умова не виконується");

console.log("-------------------");

// Область визначення
for (let i = 0; i < 4; i += 1) {
  // початок дії (область визначення) змінної i
  console.log(i);
}
// кінець дії (область визначення) змінної i

// Помилка через те, що змінна i не оголошена,
// тому що оголошення вище в циклі for дійсні лише для тіла циклу
// console.log(i); // ReferenceError: i is not defined

let h = 0; // глобальна змінна, доступна у всьому файлі, після оголошення
// зберігається в пам'яті, поки вкладка не закриється

while (h < 5) {
  console.log("h =", h);
  h += 1;
}

console.log("*h =", h);

for (h; h < 8; h += 1) {
  console.log("h =", h);
}

console.log("**h =", h);

for (let k = h; k < 12; k += 1) {
  // змінна k - локальна змінна, доступна лише в межах циклу (між {})
  // значення забувається після виходу з циклу,
  // ресурси ком'ютера звільняються
  console.log("h =", h, "k =", k);

  const m = 42; // - локальна змінна, доступна лише в межах циклу (між {})
}
// змінна k вже не існує
// змінна m вже не існує

// Помилка через те, що змінна k не оголошена,
// тому що оголошення вище в циклі for дійсні лише для тіла циклу
// console.log(k); // ReferenceError: k is not defined
// console.log(m); // ReferenceError: m is not defined

if (3 < 20) {
  const p = "Thu"; // - локальна змінна, доступна лише в межах циклу (між {})

  console.log("p =", p, "h =", h);
}

// 5. Перевірка пароля
// - Задати правильний пароль
// - Давати користувачу 3 спроби для введення
// - При правильному введенні вивести "Доступ надано"
// - Після третьої невдалої спроби вивести "Доступ заблоковано"

const correctPass = "qwerty"; // глобальна змінна

// userTry і userPass не існують
for (let userTry = 1; userTry <= 3; userTry += 1) {
  // userTry - змінна циклу, локальна змінна
  const userPass = prompt("Введіть пароль"); // локальна змінна

  if (userPass === correctPass) {
    alert("+");
    break;
  } else if (userTry === 3) {
    alert("-");
  }
}
// userTry і userPass не існують
