// Виведення чисел від 1 до 10 БЕЗ ЦИКЛІВ
console.log(1);
console.log(2);
console.log(3);
console.log(4);
console.log(5);
console.log(6);
console.log(7);
console.log(8);
console.log(9);
console.log(10);
console.log("-----------------------------");

// Виведення чисел від 1 до 10 за допомогою циклу
// Оголошуємо змінну для циклу
// і задаємо початкове значення
let i = 1;

// Поки умова (i <= 10) буде виконуватися (повертати true)
// будемо повторювати код (набір інструкцій)
// в середині блоку між {}
// Якщо або КОЛИ умова поверне false - пропускаємо або завершуємо
// цикл відповідно
while (i <= 10) {
  // Початок блоку (тіла циклу)
  console.log(i);

  // Забезпечуємо вихід з циклу:
  // робимо можливим щоб умова стала хибною
  // інакше блок буде повторюватися "вічно"
  // і доведеться закривати браузер або перезавантажувати комп'ютер
  i += 1; // i = i + 1;

  // Кінець блоку (тіла циклу)
}

console.log("-----------------------------");

// Приклад циклу з псевдокодом
let paragraf = 1;

// Поки не опрацюєш 5 параграфів доти не підеш гуляти
while (paragraf <= 5) {
  // Прочитати
  // Виписати терміни
  // Дати відповіді на питання в кінці
  // Пройти тест

  // Перейти до наступного параграфа
  paragraf += 1;
}

// Піти гуляти

// Приклад циклу while, якщо умова не виконується
console.log("=== Початок прикладу ===");

let j = 40;

while (j <= 10) {
  console.log(`j = ${j}`);

  j += 2;
}

console.log("=== Кінець прикладу ===");

// Гра: вгадати число, яке загадав комп'ютер від 0 до 10
// Задача: повторювати запит користувачу допоки він не вгадає
// або натисне Скасувати для завершення гри

// Math.random() -> від [0 до 1) -> 0.6118807830687223
// 0.6118807830687223 * 10 = 6.118807830687223
// Math.round(6.118807830687223) = 6
const compNumber = Math.round(Math.random() * 10);

console.log(`Число комп'ютера: `, compNumber);

// Для того щоб потрапити в тіло циклу
// використаємо трюк (лайфхак)
// Зробимо так, щоб на 1-у кроці умова (condition)
// завжди повертала true (виконувалася)

let userNumber = -1; // явно задаємо значення поза діапазоном [0, 10]

while (userNumber !== compNumber) {
  // Отримати відповідь від користувача

  // Створюємо нову змінну щоб уникнути зміни типу (number на string | null),
  // також назва змінної краще відображає вміст
  const userAnswer = prompt(
    "Введіть число від 0 до 10\nабо натисніть Скасувати щоб завершити гру",
  );

  // Тимчасове повідомлення для відлагодження
  console.log("Відповідь користувача:", userAnswer);

  // Перевірити введені дані
  // // Вийти або продовжити
  if (userAnswer === null) {
    // Користувач натиснув кнопку Скасувати
    alert("Гру скасовано!");
    // Виходимо з циклу
    break; // примусовий вихід з циклу
  }

  // Оскільки break завершує роботу циклу,
  // то можна обійтися без else

  // Перетворюємо відповідь користувача на число користувача
  userNumber = Number(userAnswer);

  // Тимчасове повідомлення для відлагодження
  console.log("Число користувача:", userNumber);

  // // Оцінити дані
  if (Number.isNaN(userNumber)) {
    alert("Ви ввели не число, повторіть спробу");
    continue; // зупиняє роботу циклу НА ПОТОЧНОМУ КРОЦІ
    // і починає нове (наступне) коло циклу
    // з перевірки умови while (userNumber !== compNumber)
  }

  // Привітати з перемогою чи почати нове коло
  if (userNumber === compNumber) {
    alert("Вітаємо з перемогою!\nУдача на вашому боці!");
    // Умова while (userNumber !== compNumber) стала хибною,
    // тому після досягнення кінця циклу
    // і перевірки умови відбудеться вихід з циклу
  } else {
    const diff = Math.abs(compNumber - userNumber);

    switch (diff) {
      case 1:
        alert("Дуже гаряче");
        break;
      case 2:
        alert("Гаряче");
        break;
      case 3:
        alert("Тепло");
        break;

      default:
        break;
    }
  }

  //   else if (userNumber > compNumber) {
  //     alert("Забагато");
  //   } else {
  //     // userNumber < compNumber
  //     alert("Замало");
  //   }
}

// Спрощена версія гри
// Альтернативний підхід

// На 1 кроці умова має повертати true
// щоб ХОЧА Б 1 раз зайти в цикл
while (true) {
  // Свідомо створюємо "вічний" цикл
  // і забезпечуємо вихід за допомогою break
  const userNumber2 = Number(prompt("Введіть від 0 до 10"));

  // Тут мали бути перевірки

  if (userNumber2 === compNumber) {
    alert("Вітаємо");
    break;
  }
}
