let i = 1;

// Заходимо в тіло циклу
// без жодних перевірок
do {
  // Початок тіла циклу
  console.log(i);

  i += 1;
  // Кінець тіла циклу
} while (i <= 10); // Перевірка умови
// якщо true - нове коло
// якщо false - вихід з циклу

console.log("--------------------------");

// Приклад циклу do-while,
// якщо умова не виконується

console.log("=== Початок прикладу ===");

// Оголошуємо змінну циклу
let j = 40;

// Виконувати (повторювати) код нижче...
do {
  console.log(`j = ${j}`);

  j += 2;
} while (j <= 10); // поки умова істинна (true)
// але тіло циклу виконається ХОЧА Б 1 раз

console.log("=== Кінець прикладу ===");

// Гра: вгадати число, яке загадав комп'ютер від 0 до 10
// Задача: повторювати запит користувачу допоки він не вгадає
// або натисне Скасувати для завершення гри

const compNumber = Math.round(Math.random() * 10);

console.log(`Число комп'ютера: `, compNumber);

do {
  const userAnswer = prompt(
    "Введіть число від 0 до 10\nабо натисніть Скасувати щоб завершити гру",
  );

  if (userAnswer === null) {
    alert("Гру скасовано!");
    // Виходимо з циклу
    break; // примусовий вихід з циклу
  }

  // Оскільки break завершує роботу циклу,
  // то можна обійтися без else

  userNumber = Number(userAnswer);

  if (Number.isNaN(userNumber)) {
    alert("Ви ввели не число, повторіть спробу");
    continue; // зупиняє роботу циклу НА ПОТОЧНОМУ КРОЦІ
    // і починає нове (наступне) коло циклу
    // з перевірки умови while (userNumber !== compNumber)
  }

  if (userNumber === compNumber) {
    alert("Вітаємо з перемогою!\nУдача на вашому боці!");
    // Умова while (userNumber !== compNumber) стала хибною,
    // тому після досягнення кінця циклу
    // і перевірки умови відбудеться вихід з циклу
  }
} while (userNumber !== compNumber);
