for (let i = 0; i < 5; i++) {
  console.log(i);
} // виведення чисел від 0 до 4

for (let i = 1; i <= 5; i++) {
  console.log(i);
} // виведення чисел від 1 до 5

// Оголошуємо змінну циклу "i"
// та присвоюємо їй значення 1
//
// Задаємо умову виходу з циклу (i <= 5)
//
// Створюємо умови для того, щоб умова виходу
// не виконалася - задаємо зміну значення "i" (i++)
//
// Початок виконання циклу
//
// 1. Перевірка умови
// Якщо умова хибна - завершуємо виконання,
// переходимо до наступного етапу програми
//
// Якщо умова виконується (true), то переходимо
// до виконання тіла циклу
//
// 2. Виконання тіла циклу: однієї або багатьох інструкцій
//
// 3. Змінюємо значення змінної циклу (i++)
//
// 4. Перевіряємо умову, див. пункт 1 і так по колу

console.log("-----------------------");

// Варіанти запису циклу for

for (let i = 4; i <= 43; i += 17) {
  console.log(`i =`, i);
}

console.log("-----------------------");

for (let j = 40; j < 10; j = j + 1) {
  console.log("Приклад роботи циклу for, якщо умова не виконується");
}

console.log("-----------------------");

let k = 7;

for (k = 11; k < 100; k += 37) {
  console.log(`k =`, k);
}

console.log("-----------------------");

k = 7;

for (let i = k; i < 100; i += 37) {
  console.log("i =", i);
}

console.log("-----------------------");

// Область видимості змінної
let h = 0; // глобальна змінна:
// * оголошена не в {}
// * доступна у всьому файлі після оголошення
// * зберігається в пам'яті допоки вкладка не закриється
// * оновлення значення в {} впливає на решту програми

console.log("До циклу, h =", h); // 0

while (h < 5) {
  console.log("h =", h);
  h += 1;
}

console.log("Після циклу, h =", h); // 5
// цикл вивів від 1 до 4, але останньою дією в циклі
// перед перевіркою умови було збільшення h на 1,
// h - глобальна змінна, тому 5

for (let i = h; i < 10; i += 1) {
  console.log("h =", h); // 5, тому що змінюється i, а не h
}

console.log("Після циклу for, h =", h); // 5

h = 7; // оновлення глобальної змінної на рівні файла

console.log("До циклу for-2, h =", h); // 7

for (h; h < 10; h += 1) {
  // оновлення глобальної змінної у тілі циклу
  console.log("h =", h);
}

console.log("Після циклу for-2, h =", h); // 10

// Глобальні змінні:
// + доступні в будь-якому місці програми, після оголошення
// + оновлюються в будь-якому місці програми, після оголошення
//   (зручно для зберігання спільних даних, загального стану програми)
// - оновлюються в будь-якому місці програми, після оголошення
//   (ризик випадкової зміни значення, втрати спільних даних)

// Локальні змінні
for (let i = h; i <= 12; i += 1) {
  // змінна i - локальна змінна:
  // * доступна ЛИШЕ в межах циклу, між {} і ()
  // * значення "забувається" після виходу з циклу
  //   (ресурси комп'ютера звільняються)
  // * може бути оголошена у НОВІЙ локальній області

  console.log("h =", h, " i =", i);

  const m = 42; // локальна змінна, доступна ЛИШЕ в межах циклу, між {}
}
// змінна "i" вже не існує
// змінна "m" вже не існує

// console.log("i =", i); // ReferenceError: i is not defined
// console.log("m =", m); // ReferenceError: m is not defined

// {} - створюють нову локальну область видимості
{
  //   console.log("Глобальна змінна h =", h); // ReferenceError: Cannot access 'h' before initialization
  // Отримали помилку, тому що
  // нижче перевизначили змінну h у ЛОКАЛЬНІЙ області видимості
  // (змінили правила гри)
  // і вже не можемо використовувати h до оголошення

  const h = "Hello"; // створюємо локальну змінну h,
  // яка у поточній області видимості замінює глобальну h
  console.log("Нова h =", h);

  const p = "Pryvit"; // локальна змінна відносно файлу 13-for.js
  // але буде "глобальною" для вкладених областей видимості в {}
  console.log("p =", p);

  if (p === "Pryvit") {
    const t = true;

    console.log("=== Start if ===");
    console.log("k =", k); // 7, глобальна змінна файлу, не перевизначена
    console.log("h =", h); // Hello, локальна змінна з вищого рівня, яка замінила глобальну
    console.log("p =", p); // Pryvit, локальна змінна, яка працює з вищого рівня
    console.log("t =", t); // true, локальна змінна
    console.log("=== End if ===");
  }

  //   console.log("t =", t); // ReferenceError: t is not defined
  // На цьому рівні локальної змінної t - не існує
}

// console.log("p =", p); // ReferenceError: p is not defined
console.log("h =", h); // глобальна h "повернулася"
