const fruits = ["Яблуко", "Банан", "Груша"];

console.log(fruits); // ['Яблуко', 'Банан', 'Груша']

// Додавання елементів до масиву
fruits.splice(1, 1, "Абрикос"); // додали "Абрикос" на позицію з індексом 1
// шукаємо елемент з індексом 1 (start)
// видаляємо 0 (deleteCount) елементів, починаючи з індексу 1 (start)
// додає елемент "Абрикос" у позицію 1 (start)

console.log(fruits); // ['Яблуко', 'Абрикос', 'Банан', 'Груша']

fruits.splice(2, 0, "Вишня", "Алича"); // додали кілька елементів ("Вишня", "Алича") на позицію з індексом 2

console.log(fruits); // ['Яблуко', 'Абрикос', 'Вишня', 'Алича', 'Банан', 'Груша']

// Видалення елементів з масиву
fruits.splice(2, 2); // видалили 2 елементи, починаючи з позиції з індексом 2

console.log(fruits); // ['Яблуко', 'Абрикос', 'Банан', 'Груша']

// Заміна елементів масиву
fruits.splice(1, 1, "Апельсин", "Мандарин"); // замінили елемент "Абрикос" на декілька елементів ("Апельсин", "Мандарин)
// шукаємо елемент з індексом 1 (start)
// видаляємо 1 (deleteCount) елемент ('Абрикос'), починаючи з індексу 1 (start)
// додаємо один або декілька елементів ("Апельсин", "Мандарин") у позицію 1 (start)

console.log(fruits); // ['Яблуко', 'Апельсин', 'Мандарин', 'Банан', 'Груша']

// Об'єднання масивів
const gorodina = ["Морква", "Буряк", "Картопля"];

console.log(gorodina);

const produkti = fruits.concat(gorodina); // створює новий масив, де елементами будуть
// елементи масиву fruits і елементи масиву gorodina
// fruits і gorodina залишаються без змін

console.log("produkti =", produkti);
console.log("fruits =", fruits);
console.log("gorodina =", gorodina);

// Спосіб 2
const produkti2 = [].concat(fruits, gorodina); // умовно, додали до порожнього масиву
// елементи масиву fruits і елементи масиву gorodina
// fruits і gorodina залишаються без змін
// повертається новий масив з об'єдними елементами

console.log("produkti2 =", produkti2);

// Спосіб 3
const produkti3 = [...fruits, ...gorodina]; // створюємо новий масив з об'єднання елементів
// масивів fruits і gorodina

console.log("produkti3 =", produkti3);

// Зміна порядку розташування елементів у масиві на протилежний
const numbers = [1, 2, 3, 4, 5];

console.log(numbers); // [1, 2, 3, 4, 5]

numbers.reverse(); // змінюємо порядок розташування елементів у поточному масиві на зворотній
// не створює новий масив

console.log(numbers); // [5, 4, 3, 2, 1]

// Створення рядка з масиву
// 14. Дано масив ["Яблуко", "Банан", "Груша"].
// Використовуючи цикл, об’єднайте всі елементи масиву в один рядок, розділивши комами.
// Наприклад, "Яблуко, Банан, Груша".

const arr14 = ["Яблуко", "Банан", "Груша"];

// Спосіб 1
let result14 = "";

for (let index = 0; index < arr14.length; index++) {
  const element = arr14[index];

  if (index === 0) {
    result14 += element;
  } else {
    result14 += ", " + element;
  }
}

console.log(result14);

// Спосіб 2
console.log(arr14.join(", ")); // об'єднує елементи масиву в один рядок
// з розділенням за допомогою ", "

// Перевірка існування елемента в масиві

// 9+. Вивести елементи масиву, крім певного числа
// Дано масив [1, 2, 3, 4, 5, 6].
// Запитати користувача число.
// Використовуючи цикл і умовний оператор, перевірити чи є у масиві число, яке ввів користувач.

const arr9 = [1, 2, 3, 4, 5, 6];

// Спосіб 1
const userNumber = 8; // Number(prompt("Input number"));
let numberInArray = false;

for (const element of arr9) {
  if (element === userNumber) {
    numberInArray = true;
  }
}

console.log(`Наявність числа ${userNumber} в масиві ${arr9}:`, numberInArray);

// Спосіб 2
numberInArray = arr9.includes(userNumber); // перевіряє наявність значення змінної userNumber
// у масиві arr9, повертає true - якщо число в масиві, false - якщо числа немає

console.log(`Наявність числа ${userNumber} в масиві ${arr9}:`, numberInArray);

// Спосіб 3
const position9 = arr9.indexOf(userNumber); // шукає значення змінної userNumber
// у масиві arr9 і повертає (-1) - якщо числа немає в масиві, index - якщо число є в масиві
// (-1), тому що нумерація елементів масиву починається з 0,
// тобто якщо елемент який ми шукаємо знаходиться на першій позиції, то його індекс = 0,
// відповідно indexOf() поверне позицію елемента - 0

console.log(`Позиція числа ${userNumber} в масиві ${arr9}:`, position9);

numberInArray = position9 >= 0;

console.log(`Наявність числа ${userNumber} в масиві ${arr9}:`, numberInArray);
