const fruits = ["Яблуко", "Банан", "Груша"];

console.log(fruits);

fruits.length; // властивість, тому БЕЗ (),
// властивість - зберігає якусь інформацію,
// у даному випадку - довжину масиву (кількість елементів)

fruits.join(); // метод, тому з (),
// метод виконує певну дію, може повертати результат

// Додавання елементів у масив

fruits.push("Апельсин"); // додаємо "Апельсин" у кінець масиву fruits,
// довжина масиву АВТОМАТИЧНО збільшується,
// "Апельсин" стає останнім елементом

console.log(fruits); // ['Яблуко', 'Банан', 'Груша', 'Апельсин']

const countAfterPush = fruits.push("Виноград", "Слива"); // ОДНОЧАСНО
// додаємо в кінець масиву fruits 2 елементи
// і повертаємо значення НОВОЇ довжини у змінну,
// "Слива" стає останнім елементом

console.log(fruits); // ['Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград', 'Слива']
console.log("У масиві", countAfterPush, "елементів");

fruits.unshift("Манго", "Вишня"); // додаємо 2 елементи НА ПОЧАТОК
// масиву fruits, "Манго" стає першим елементом, але з індексом 0
// Значенням, яке повертає метод нехтуємо

console.log(fruits); // ['Манго', 'Вишня', 'Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград', 'Слива']

// Видалення крайніх елементів масиву

const deletedFruit = fruits.pop(); // видаляємо останній елемент масиву fruit ("Слива")
// і повертаємо його щоб записати у змінну

console.log(fruits); // ['Манго', 'Вишня', 'Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград']
console.log(deletedFruit); // "Слива"

console.log(`Елемент "${deletedFruit}" видалено з кошика
У кошику залишилося ${fruits.length} елементів:
${fruits}`);

fruits.shift(); // видаляємо ПЕРШИЙ елемент масиву fruit ("Манго")
// Значенням, яке повернтає метод ("Манго") нехтуємо

console.log(fruits); // ['Вишня', 'Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград']

console.log("------------------------------------------");

// splice - комбінований метод керування вмістом масиву

let splicedFruits = fruits.splice(2); // видаляємо з масиву fruits елементи
// від індекса 2 ВКЛЮЧНО до кінця (тому що 2-й параметр deleteCount - не задано)
// видалені елементи записуємо у змінну

console.log("Видалені елементи:", splicedFruits); // ['Банан', 'Груша', 'Апельсин', 'Виноград']
console.log("Те що залишилося:", fruits); // ['Вишня', 'Яблуко']

// Відновлюємо масив за допомогою метода push і спред-оператора (...),
// інакше (без ...) отримали б вкладений масив
fruits.push(...splicedFruits);

console.log(fruits); // ['Вишня', 'Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград']

splicedFruits = fruits.splice(2, 3); // видаляємо з масиву fruits
// елементи 3 (deleteCount) елементи починаючи з індекса 2 (start) ВКЛЮЧНО

console.log("Видалені елементи:", splicedFruits); // ['Банан', 'Груша', 'Апельсин']
console.log("Те що залишилося:", fruits); // ['Вишня', 'Яблуко', 'Виноград']

// fruits.splice(0, 1); // видаляє 1-й елемент масиву
// fruits.splice(0, 3); // видаляє перші 3 елементи масиву

splicedFruits = fruits.splice(2, 0, ...splicedFruits); // див. нижче
// шукаємо елемент з індексом 2 (start)
// видаляємо 0 (deleteCount) елементів, починаючи з індексу (start)
// додаємо елементи масиву splicedFruits (за допомогою спред-оператора ...)
// у позицію 2 (start)

console.log("Видалені елементи:", splicedFruits); // []
console.log("Оновлений масив:", fruits); // ['Вишня', 'Яблуко', 'Банан', 'Груша', 'Апельсин', 'Виноград']

// Заміна елемента масиву
fruits.splice(3, 1, "Барбарис");

console.log("Оновлений масив:", fruits); // ['Вишня', 'Яблуко', 'Банан', 'Барбарис', 'Апельсин', 'Виноград']
