const hello = "Привіт, світе";

console.log(hello);
console.log("Довжина рядка =", hello.length);
// Рядки в JS, як і масиви, мають властивість length
// для отримання інформації про їх довжину
// (кількість символів між лапками),
// а також методи для їх обробки

console.log("Перший символ:", hello[0]); // П
console.log("Перший символ:", hello.at(0)); // П

console.log("Останній символ:", hello[hello.length - 1]); // е
console.log("Останній символ:", hello.at(-1)); // е

// Доступ до елементів рядка (символів: цифри, літери тощо),
// як і для масивів відбувається за індексом: <змінна>[index]
// Як і для масивів, нумерація індексів починається з 0

hello[8] = "С"; // спроба змінити "світе" на "Світе"

console.log(hello); // Привіт, світе

// Рядки НЕ дозволяють змінювати свої символи за індексом

let a = "word";
const b = a;

a = "wed";

console.log("a =", a); // wed
console.log("b =", b); // word

// Рядки, на відміну від масивів, примітивний тип
// й інакше працюють з пам'яттю

// Основні методи рядків
console.log(
  "Рядок у нижньому регістрі (всі літери маленькі) -",
  hello.toLowerCase(), // () в кінці обов'язкові, тому що це виклик метода (функції)
  // виклик функції - "примус" до виконання дії
  hello.toLocaleLowerCase("uk-UA"), // з врахуванням локальних українських особливостей
); // привіт, світе привіт, світе

console.log(
  "Рядок у ВЕРХНЬОМУ регістрі (всі літери великі) -",
  hello.toUpperCase(),
  hello.toLocaleUpperCase("uk-UA"),
); // ПРИВІТ, СВІТЕ ПРИВІТ, СВІТЕ

console.log("Оригінальний рядок -", hello); // Привіт, світе
// Більшість методів НЕ мутують рядок,
// тобто не змінюють оригінал,
// повертають модифіковану копію

console.log("1-й символ у нижньому регістрі -", hello[0].toLowerCase()); // п
console.log(
  "Останній символ у ВЕРХНЬОМУ регістрі -",
  hello.at(-1).toUpperCase(),
); // Е

// Методи рядків, як і масивів, можна поєднувати
// у "ланцюжки", тобто писати один за одним поєднуючи "."

console.log(
  `Розташування слова "word" у рядку "${hello}" -`,
  hello.indexOf("word"),
); // -1, тому що в рядку "Привіт, світе" немає слова "word"

console.log(
  `Розташування 1-го складу "ві" у рядку "${hello}" -`,
  hello.indexOf("ві"),
); // 3

console.log(
  `Розташування 2-го складу "ві" у рядку "${hello}" -`,
  hello.indexOf("ві", 4), // починаємо пошук з індекса 4
); // 9

console.log(`Рядок "${hello}" містить слово "світ" -`, hello.includes("світ")); // true
console.log(`Рядок "${hello}" містить слово "лист" -`, hello.includes("лист")); // false

// .includes - просто перевіряє чи є в рядку символ або слово
// .indexOf - вказує розташування або відсутність

console.log(
  `Чи починається рядок "${hello}" зі слова "Привіт"? -`,
  hello.startsWith("Привіт"), // Регістр важливий
); // true

console.log(
  `Чи закінчується рядок "${hello}" словом "лист"? -`,
  hello.endsWith("лист"), // Регістр важливий
); // false

const spaceHello = `      

Hello, world!   

    `;

console.log(`Оригінальний рядок 2 - "${spaceHello}"`);
console.log(`Оброблений рядок 2 - "${spaceHello.trim()}"`);
// .trim() - обрізає пробіли і перенесення рядків з обох країв рядка,
// є версії для початку .trimStart() і кінця .trimEnd()

let someTime = "9:07:23";

console.log(`0${someTime}`); // 09:07:23

someTime = "10:07:23";

console.log(`0${someTime}`); // 010:07:23

console.log("9:07:23".padStart(8, "0")); // 09:07:23
console.log("10:07:23".padStart(8, "0")); // 10:07:23
console.log("Loading".padEnd(10, ".")); // Loading...

// .padStart(), .padEnd() - доповнюють рядок
// на початку або в кінці відповідно
// до вказаної довжини (8 або 10)
// вказаним символом ("0" або "."),
// якщо рядок вже має потрібну довжину,
// то нічого не відбувається

const words = ["У", "мене", "вийде", "вивчити", "JS", "у", "2026", "році"];

console.log(`"${words.join(" ")}"`); // "У мене вийде вивчити JS у 2026 році"

const str = "У мене вийде вивчити JS у 2026 році";

console.log(str.split(" ")); // ['У', 'мене', 'вийде', 'вивчити', 'JS', 'у', '2026', 'році']

// .split() дозволяє розділити рядок на елементи масиву,
// розділення відбувається по вказаному символу (кількох символах)

const helloSerhii = hello.replace("світе", "Serhii");
// .replace() - шукає в рядку hello ПЕРШЕ входження слова "світе"
// і замінює його на "Serhii"
// Повертає новий рядок, старий - не змінює

console.log("helloSerhii =", helloSerhii); // Привіт, Serhii

console.log(hello.replaceAll("віт", "...")); // При..., с...е
console.log(hello.replaceAll("і", "1")); // Прив1т, св1те
// .replaceAll() - замінює в рядку hello ВСІ входження
// символів "віт" або "і" на "..." чи "1" відповідно

// Отримання частини рядка

// Привіт, світе
// 0123456789111
//           012

// .slice(start [, end]) - як і для масивів, повертає частину рядка
// з індекса start до індекса end, але не включає позицію end
// Підтримує від'ємні значення
console.log(hello.slice(8, 12)); // світ
console.log(hello.slice(8, -1)); // світ
console.log(hello.slice(-5, -1)); // світ
console.log(hello.slice(8)); // світe
console.log(hello.slice(-5)); // світe

const search = "світ";
const start = hello.indexOf(search); // 8
const end = start + search.length; // 12

console.log(hello.slice(start, end)); // світ

// .substring(start [, end]) - повертає частину рядка
// від індекса start до індекса end, але не включає позицію end
// дозволяє "переплутати" параметри,
// тобто задати більше значення end на місці start
// від'ємні значення не підтримуються
console.log(hello.substring(8, 12)); // світ
console.log(hello.substring(12, 8)); // світ
console.log(hello.substring(8)); // світe

const testStr = "  У  мене  вийде   вивчити   JS   у   2026   році  ";

// Прибрати зайві пробіли у рядку testStr

console.log(
  testStr
    .trim() // "У  мене  вийде   вивчити   JS   у   2026   році"
    .split(" ") // ['У', '', 'мене', '', 'вийде', '', '', 'вивчити', '', '', 'JS', '', '', 'у', '', '', '2026', '', '', 'році']
    .filter((element) => element !== "") // ['У', 'мене', 'вийде', 'вивчити', 'JS', 'у', '2026', 'році']
    .join(" "), // У мене вийде вивчити JS у 2026 році
);
