// Оголошення змінної
// Синтаксис
// ключове_слово назва_змінної;
// ключове_слово назва_змінної = значення;
// Ключові слова: let, const
// "=" - оператор присвоєння

let message; // оголошення змінної message без початкового значення (без ініціалізації)
// змінні, оголошені за допомогою let - можна змінювати

let x = 5; // оголошення змінної x і присвоєння їй значення 5, потім можна змінити

// Ключове слово let використовуємо коли ВПЕВНЕНІ,
// що значення змінної доведеться міняти

// Оголошення змінної зі значенням, яке потім не можна змінити
const robochaAdresa = "m. Rivne, vul. V. Opanasiuka, 8";

// Помилки
// const domashniaAdresa; // при використанні const ОБОВ'ЯЗКОВО задавати значення
// robochaAdresa = "m. Lviv, vul. Soborna, 1"; // НЕ МОЖНА змінювати значення змінної
// оголошеної як const

// Ключове слово const використовуємо коли знаємо значенні і ВПЕВНЕНІ,
// що його НЕ доведеться міняти

// Практична рекомендація
// Якщо знаєте значення для змінної,
// але не впевнені, чи буде воно змінюватися,
// то використайте const, за потреби потім
// можна буде повернутися і замінити на let

// Виклик змінних (звернення до змінних)

console.log(message); // undefined
console.log(x); // 5
console.log(robochaAdresa); // m. Rivne, vul. V. Opanasiuka, 8

// Під час виклику (зверненні) змінної на її місце
// підставляється значення, тому в консолі отримали:
// undefined - тому що змінна message НЕ ініціалізована (не присвоєне значення)
// 5 - тому що x = 5
// m. Rivne, vul. V. Opanasiuka, 8 - тому що robochaAdresa = "m. Rivne, vul. V. Opanasiuka, 8"

// якщо оголосити змінну з допомогою let
// і не присвоїти (=) їй значення,
// то її значення буде undefined
let h; // h = undefined
let w = 200; // w = 200

// Редагування (оновлення) змінних

// Якщо змінна не const, то її значення
// можна оновити за допомогою оператора присвоєння (=)
message = "Hello, world";
x = -15;
h = 200;

console.log(message); // Hello, world
console.log(x); // -15
console.log(h); // 200

// Рекомендація щодо виводу в консоль
// додавати підписи (назви змінних) до значень, які виводимо
console.log("message =", message); // message = Hello, world
console.log("x =", x); // x = -15
console.log("h =", h); // h = 200

// Особливості неймінгу змінних

// 1. Назва має бути унікальною в межах області видимості (поки що це файл)
// За потреби значення змінної можна змінити
const q1 = 13;
// const q1 = 45; // Помилка: змінна q1 вже оголошена
let a3 = 12;
// let a3 = 78; // Помилка: змінна a3 вже оголошена

// 2. Назва змінної може складатися з літер, цифр, $, _,
// не може починатися з цифри
const tree = "Ялинка";
let money$;
let top_rate = 34;
const h3 = 56;
const _width = 500;
let $color = "red";

// Можна, але не бажано
const дерево = "Ялинка";

// const 1h = 5; // Помилка
// const top spisok = 0; // Помилка
// const top-spisok = 0; // Помилка

// 3. Регістр літер (великі чи маленькі) важливий
const Apple = "iPhone";
const apple = "Ред принц";
const APPLE = "Симеренко";

// Оголосили 3 різні змінні з 3 різними значеннями,
// жодної помилки про попереднє оголошення

console.log("Apple =", Apple);
console.log("apple =", apple);
console.log("APPLE =", APPLE);

// 4. Можна об'єднувати декілька слів для назви змінної
// у вигляді camelCase (верблюжий регістр),
// коли перше слово пишеться з малої літери,
// а кожне наступне без пробіла з Великої
const articleName = "JavaScript";
let errorMessage;

// ГЛОБАЛЬНІ_ЗМІННІ
// Загальновідомі фізичні, математичні сталі,
// широковживані значення і подібні константи
// часто записують у наступному вигляді
const COLOR_RED = "#ff0000";
const COLOR_GREEN = "#00ff00";
const COLOR_BLUE = "#0000ff";

// Стала Планка
const PLANK = 6.62607015 * 10 ** -34; // Рекомендовано
const plank = 6.62607015 * 10 ** -34; // Не рекомендовано
