// Функція - "програма" в програмі
// створює власну локальну область видимості

// Оголошення функції
// 1. Ключове слово function
// 2. Задаємо назву функції, аналогічно назві змінної
//    (придумує програміст)
// 3. Круглі дужки () для параметрів,
//    або порожні, якщо параметри не потрібні
// 4. Фігурні дужки {} для тіла функції,
//    який буде щось робити, наприклад обробляти вхідні параметри
// 5. Якщо функція має повертати результат, то
//    ключове слово return і значення, яке повертається
function showMessage() {
  console.log("Тіло функції");
}

// Виклик функції
// назва_функції + ()
// Без виклику функція нічого не робить
showMessage();

showMessage; // НЕ виклик функції, тому що немає ()

console.log(showMessage); // через відсутність () у консолі буде код функції
console.log(showMessage()); // 2 рядки:
// 1. "Тіло функції", оскільки викликали функцію,
// 2. undefined, тому що функція НІЧОГО не повертає,
//    у неї немає return

// Приклад функції без вхідних параметрів,
// яка повертає число
function indianRandom() {
  return 42; // return - ключове слово,
  // яке забезпечує негайний вихід з функції
  // та повернення фунцією вказано значення
}

console.log('"Випадкове" число:', indianRandom()); // 42
console.log('"Випадкове" число:', indianRandom()); // 42
console.log('"Випадкове" число:', indianRandom()); // 42

// Приклад функції з 1 вхідним параметром,
// яка НЕ повертає нічого
//
// limit - параметр функції, виконує роль локальної змінної
// (існує ЛИШЕ в межах функції)
// Після виклику функції, у змінну limit записується
// значення, яке передається під час виклику
// Після виконання тіла функції - очищується
function showRandomNumber(limit) {
  // Початок тіла функції, limit = 10 || 100
  console.log("Випадкове число:", Math.ceil(Math.random() * limit));
  // Кінець тіла функції
  // Функція нічого не повертає, тому підказка редактора коду
  // закінчується словом void
  // але console.log(showRandomNumber(10)) поверне undefined
}

// Виклик функції з параметром
showRandomNumber(10); // 10 буде записано у "змінну" limit
showRandomNumber(10);
showRandomNumber(100);
showRandomNumber(100);

console.log(
  `Функція "showRandomNumber(10)" виконується, але повертає:`,
  showRandomNumber(10),
); // undefined

// Приклад оголошення функції з 2 вхідними параметрами,
// яка повертає результат обробки цих параметрів
//
// add - назва функції, придумує програміст,
//       вимоги і рекомендації як для змінної,
//       використовується для виклику функції,
//       щоб вона виконала свій код,
//       область видимості "глобальна"
// x, y - параметри функції, придумує програміст,
//        вимоги і рекомендації як для змінної,
//        область видимості "локальна" - тіло функції
function add(x, y) {
  console.log("x =", x);
  console.log("y =", y);

  return x + y; // повертає результат обробки параметрів
}

console.log("45 + 23 = add(45, 23) =", add(45, 23)); // 68

const sum = add(5, 3); // Викликаємо функцію add
// для розрахунку суми чисел 5 і 3,
// результат, який повертає функція
// записуємо у змінну sum

console.log("sum =", sum);

// Приклад оголошення функції з вхідним параметром,
// який має значення за замовчуванням
// функція не повертає жодного результату
// (немає ruturn, повертає undefined)
//
// name - параметр функції з значенням за замовчуванням,
// якщо під час виклику функції НЕ буде задано аргумент (значення для параметра),
// то у name буде записано "гість"
function greet(name = "гість") {
  console.log(`Привіт, ${name}`);
}

let userName;

// Приклад виклику функції з параметром,
// який має значення за замовчуванням

// Параметр за замовчуванням не знадобився
greet("Serhii"); // Привіт, Serhii
greet("Oleh"); // Привіт, Oleh
greet(""); // "Привіт, "
greet(null); // Привіт, null

// Параметр за замовчування спрацював
greet(); // Привіт, гість
greet(undefined); // Привіт, гість
greet(userName); // Привіт, гість
