const a = 10; // оголошення змінної з ініціалізацією
const b = 5;

let d; // оголошення змінної
let p = 0; // оголошення змінної з ініціалізацією

d = 12;
d = 5; // false;
d = 3; // "Wed";

// Арифметичні оператори
console.log(`${a} + ${b} = ${a + b}`);
console.log(`${a} - ${b} = ${a - b}`);
console.log(`${a} * ${b} = ${a * b}`);
console.log(`${a} / ${b} = ${a / b}`);

// Остача від ділення
console.log(`${a} % ${b} = ${a % b}`);
console.log(`${b} % ${a} = ${b % a}`);
console.log(`${a} % 3 = ${a % 3}`);
console.log(`5 % 2 = ${5 % 2}`); // непарне число
console.log(`4 % 2 = ${4 % 2}`); // парне число

// Піднесення до степеня
console.log(`${a} ** ${b} = ${a ** b}`);
console.log(`2 у степені 3 = ${2 ** 3}`);
console.log(`2 у степені 10 = ${2 ** 10}`);

const x = "42";
const y = "18";

console.log(`Тип константи x = ${x}: ${typeof x}`);
console.log(`Тип константи y = ${y}: ${typeof y}`);

console.log(x + y);
console.log(a + y);

// Не явне перетворення типів
console.log(x + a); // якщо "число + рядок", то число -> рядок
console.log(a * y); // якщо "число * рядок", то рядок -> число (намагається)
console.log(a / y); // якщо "число / рядок", то рядок -> число (намагається)
console.log(a - y); // якщо "число - рядок", то рядок -> число (намагається)

// Оператори присвоєння
let t = new Date().getMinutes(); // Поточна хвилина;

console.log(`t = ${t}`);

// Збільшити значення t на 3

// Звичайний варіант
t = t + 3; // тотожно t += 3;

console.log(`t = t + 3 = ${t - 3} + 3 = ${t}`); // (t - 3) - для відображення значення перед додаванням

// Скорочений варіант
t += 3; // тотожно t = t + 3;

console.log(`t = t += 3 = ${t - 3} += 3 = ${t}`); // (t - 3) - для відображення значення перед додаванням

// Зменшити значення t на 2
t = t - 2; // тотожно t -= 3;

console.log(`t = t - 2 = ${t + 2} - 2 = ${t}`); // (t + 2) - для відображення значення перед додаванням

t -= 2; // тотожно t = t - 2;

console.log(`t = t -= 2 = ${t + 2} -= 2 = ${t}`); // (t + 2) - для відображення значення перед додаванням

// Помножити значення t на 4
t = t * 4; // Звичайний варіант
t *= 4; // Скорочений варіант

// Поділити значення t на 10
t = t / 10; // Звичайний варіант
t /= 10; // Скорочений варіант

console.log(`t = ${t}`);

// Оператори інкременту/декременту
// Постфіксний інкремент
let i = 8;

console.log(`i = ${i++}`); // читаємо значення "і", виводимо у консоль значення "і" (8),
// а потім збільшуємо значення "i" на 1: i = i + 1 | i += 1

console.log(`i = ${i}`);

// Альтернативний варіант зі змінною j
let j = 8;

console.log(`j = ${j}`);

j = j + 1; // j += 1;

console.log(`j = ${j}`);

// Нехай `xx = 10`.
// Збільшити його на 5 через `+=`, потім ще на 1 через `++`.
// Виведи результат.

let xx = 10;
console.log(`xx = ${xx}`);

xx += 5; // xx = xx + 5 = 10 + 5 = 15
console.log(`xx = ${xx}`);

xx++; // xx = xx += 1 = xx + 1 = 15 + 1 = 16
console.log(`xx = ${xx}`);

// Префіксний інкремент
let k = 8;

console.log(`k = ${++k}`); // читаємо значення "k",
// збільшуємо значення "k" на 1: k = k + 1 | k += 1
// виводимо у консоль збільшене значення  "k" (9)
