// alert("Діалогове вікно з повідомленням");

// Записуємо у змінну значення, яке ввів користувач і натиснув ОК
// або "Значення за замовчуванням", якщо просто натиснув ОК
// або null, якщо натиснув Скасувати
const answerWithDefault = prompt(
  "Повідомлення" /* Підпис для діалогового вікна (над полем введення) */,
  "Значення за замовчуванням" /* Вміст для поля введення */,
);

console.log("Відповідь користувача:", answerWithDefault);

const answerNoDefault = prompt("Введіть текст");

console.log(
  "Відповідь користувача без значення за замовчуванням",
  `>${answerNoDefault}<`,
  "тип змінної:",
  typeof answerNoDefault,
);

// Якщо користувач нічого не введе і натисне ОК,
// то у змінну запишеться порожній рядок ""

const userNumber = prompt("Введіть число від 1 до 20", "10");

console.log("Число користувача:", userNumber, "має тип:", typeof userNumber);

const someNumber = 14;

console.log(
  "Сума числа користувача і деякого іншого числа:",
  userNumber + someNumber,
); // ?

// Якщо результат prompt - рядок (наприклад "12"),
// то JS перетворює число someNumber в рядок
// і виконує конкатенацію (об'єднання),
// тому "12" + 14 = 1214, а не 26

// Якщо результат prompt - null,
// то JS перетворить null в 0,
// тоді результат = 0 + 14 = 14

// Для виконання операції +
// JS за будь-якого сценарію дій користувача
// виконає неявне перетворення типів

// Явне перетворення типів
const convertedUserNumber = Number(userNumber);
// рядок у число
// string у number

console.log(
  'Сума "обробленого" числа користувача і деякого іншого числа:',
  convertedUserNumber + someNumber,
); // ?

// Перевірка дій користувача
// Мета: відслідкувати натискання кнопки Скасувати

const userMonth = prompt("Введіть номер місяця, у якому народилися");

// Перевірка
// Умовний оператор
// Якщо значення змінної userMonth дорівнює null,
if (userMonth == null) {
  // то виводимо повідомлення з подякою
  // і завершуємо роботу
  alert("Дякуємо за ваш час!");
} else {
  // інакше користувач натиснув ОК,
  // тоді дякуємо і перетворюємо введене значення або ""
  // на число
  console.log("Дякуємо за відвертість", Number(userMonth));
}
