// Оператори порівняння
// Результат - значення логічного типу (Boolean): true або false

// Більше
console.log("5 > 3:", 5 > 3); // true
console.log("3 > 5:", 3 > 5); // false

// Менше
console.log("3 < 5:", 3 < 5); // true
console.log("5 < 3:", 5 < 3); // false

// Більше або дорівнює
console.log("5 >= 3:", 5 >= 3); // true
console.log("3 >= 5:", 3 >= 5); // false
console.log("4 >= 4:", 4 >= 4); // true

// Менше або дорівнює
console.log("3 <= 5:", 3 <= 5); // true
console.log("5 <= 3:", 5 <= 3); // false
console.log("4 <= 4:", 4 <= 4); // true

// Не явне перетворення типів
console.log(`"5" > 3:`, "5" > 3); // true
console.log(`4 >= "3":`, "4" >= 3); // true
console.log(`"-3" > "2":`, "-3" > "2"); // false
console.log(`"-3" <= "2":`, "-3" <= "2"); // true

// Не дорівнює
console.log("5 != 3", 5 != 3); // true
console.log("4 != 4", 4 != 4); // false

// Не строге порівняння (==)
// Спочатку аналізується ліва і права частина (між ==)
// за потреби відбувається не явне перетворення типів
// робиться порівняння
console.log(`3 == 3:`, 3 == 3); // true (чи 3 дорівнює 3)
console.log(`3 == 4:`, 3 == 4); // false (чи 3 дорівнює 4)
console.log(`5 == "5":`, 5 == "5"); // true (чи 5 дорівнює "5", відбувається не явне перетворення типів)
console.log(`5 == "4":`, 5 == "4"); // false (чи 5 дорівнює "4", відбувається не явне перетворення типів)

// Строге порівняння (===): важливі типи аргументів (ліва та права частина)
// Спочатку перевіряються типи лівої та правої частини
// typeof <ліва частина> == typeof <права частина>
// якщо типи не співпадають, то повертається false
// якщо типи співпадають, то відбувається порівняння значень
console.log(`3 === 3:`, 3 === 3); // true (чи 3 дорівнює 3)
console.log(`3 === 4:`, 3 === 4); // false (чи 3 дорівнює 4)
console.log(`5 === "5":`, 5 === "5"); // false (чи 5 дорівнює рядку "5", не явне перетворення типів не відбувається)
console.log(`"5" === "5":`, "5" === "5"); // true (чи рядок "5" дорівнює рядку "5", не явне перетворення типів не відбувається)
console.log(`5 === "4":`, 5 === "4"); // false (чи 5 дорівнює рядку "4", не явне перетворення типів не відбувається)

// Приклади зі змінними
const a = 10;
const b = -4;
const c = "8";
const d = "5";

console.log("a > b:", a > b); // true
console.log("a < c:", a < c); // false
console.log("a >= b:", a >= b); // true
console.log("a != b:", a != b); // true
console.log("c === b:", c === b); // false (спочатку порівнюються типи, потім - значання)
console.log("c === d:", c === d); // false (спочатку порівнюються типи, потім - значання)

console.log("(a + b) <= c:", a + b <= c); // true (10 + (-4) <= "8" / 6 <= 8 / true)

// Простий умовний оператор if (умова) {}
console.log("-----------------------");
console.log("Далі буде умовний оператор, з умовою, яка виконується");

// якщо 5 > 3, виводимо у консоль повідомлення
if (5 > 3) {
  console.log("Еврика, 5 > 3");
}

if (b < d) {
  console.log("Еврика, b < d");
}

console.log("Далі буде умовний оператор, з умовою, яка НЕ виконується");

if (4 > 9) {
  // умова не виконується
  // програма не "заходить" сюди, у {}
  console.log("Диво, 4 > 9");
}

if (c === a) {
  // умова не виконується
  // програма не "заходить" сюди, у {}
  console.log(`Диво, c === a ("8" === 10)`);
}

console.log("-----------------------");

const vidstanDostavki = 20; // km
const cinaDostavki = 30; // UAH за 1 км

let vartist = vidstanDostavki * cinaDostavki;

// якщо відстань доставки більша або рівна 20 км,
// то вартість збільшується на 100 грн
if (vidstanDostavki >= 20) {
  vartist = vartist + 100;
  // vartist += 100;
  console.log("Відстань не менша 20");
}

console.log("vartist =", vartist);
console.log("-----------------------");

// Умовний оператор з альтернативним ходом подій if () {} else {}
const temperature = 15;

// якщо значення змінної temperature більше 20
if (temperature > 20) {
  // то виводимо слово "Тепло"
  console.log("Тепло");
} else {
  // інакше (значення змінної temperature менше АБО дорівнює 20)
  // виводимо речення "Прохолодно або холодно"
  console.log("Прохолодно або холодно");
}

console.log("-----------------------");

// Умовний оператор з кількома альтернативними ходами подій if () {} else if () {} else {}

const ocinka = 85;

// якщо оцінка більша 90
if (ocinka > 90) {
  // то виводимо Відмінно
  console.log("Відмінно");
  // і завершуємо перевірку
} else if (ocinka >= 75) {
  // інакше, якщо оцінка більша, або рівна 75
  // виводимо Добре
  console.log("Добре");
  // і завершуємо перевірку
} else if (ocinka >= 60) {
  // інакше, якщо оцінка більша, або рівна 60
  // виводимо Задовільно
  console.log("Задовільно");
  // і завершуємо перевірку
} else {
  // інакше, виводимо Не задовільно
  console.log("Не задовільно");
}

console.log("-----------------------");

// якщо оцінка більша 90
if (ocinka > 90) {
  // то виводимо дуже хвалимо
  console.log("Великий молодець");
  // і завершуємо перевірку
} else if (ocinka >= 75) {
  // інакше, якщо оцінка більша, або рівна 75
  // то просто хвалимо
  console.log("Молодець");
  // і завершуємо перевірку
} // немає else, тому що не хвалимо за погані оцінки, і не сваримо

console.log("-----------------------");
