const age = 18;

// Якщо значення змінної age більше або рівне 18, то...
if (age >= 18) {
  // виводимо у консоль текст "Ви повнолітні"
  console.log("Ви повнолітні");
}
// Якщо значення змінної age менше 18, то...
// Продовжуємо роботу за будь-якого значення age

const a = 10;
const b = -4;

console.log("Далі буде перевірка на диво");

if (a < b) {
  // Умова НЕ виконується,
  // програма НІКОЛИ не потрапить у ці {}
  console.log("Сталося диво, 10 менше -4");
}

console.log("Кінець перевірки на диво");

// Якщо відстань доставки більша або рівна 20 км,
// то вартість збільшується на 100 грн

const vidstan = 20; // km
const cina = 30; // грн/км

// Рахуємо базову вартість доставки
let vartist = vidstan * cina; // грн

// Перевіряємо відстань доставки,
// щоб за потреби (виконання умови)
// збільшити вартість на сталу суму
if (vidstan >= 20) {
  vartist = vartist + 100; // vartist += 100;
  console.log("Відстань не менша 20 км");
}

// Виводимо або базову вартість, або збільшену
// якщо умова виконалася
console.log(`Вартість доставки: ${vartist} грн`);

console.log("-------------------------------------");

// Умовний оператор з альтернативним ходом подій
// if () {} else {}

const cinaPomidoriv = 40;

console.log(`Ціна помідорів: ${cinaPomidoriv} грн`);

// Якщо ціна помідорів менша 30 грн/кг, то...
if (cinaPomidoriv < 30) {
  console.log("Купуємо помідори, ціна < 30");
} /* ІНАКШЕ... */ else {
  console.log("Купуємо огірки, помідори дорогі (> 30 грн)");
}

console.log("-------------------------------------");

// Умовний оператор з кількома альтернативними сценаріями
// if () {} else if () {} ... else if () {} else {}

const ocinka = 85;

// Якщо оцінка більша або рівна 90, то...
if (ocinka >= 90) {
  // виводимо у консоль:
  console.log("Відмінно, 5");
  // і завершуємо перевірку
  // наступні перевірки "else if" ІГНОРУЄМО
} /* ІНАКШЕ перевіряємо */ else if (ocinka >= 75) {
  // ... оцінка менша 90, але більша або рівна 75
  // виводимо в консоль:
  console.log("Добре, 4");
  // і завершуємо перевірку
  // наступні перевірки "else if" ІГНОРУЄМО
} else if (ocinka >= 60) {
  console.log("Задовільно, 3");
} /* ІНАКШЕ */ else {
  // жоден попередній сценарій (перевірка)
  // не спрацював, тому виводимо в консоль:
  console.log("Не задовільно, 2 або 1");
  // завершуємо перевірки
}

const grade = 85;

if (grade >= 90) {
  console.log("Відмінно");
} else if (grade >= 75) {
  console.log("Добре");
} else if (grade >= 60) {
  console.log("Задовільно");
} else {
  console.log("Незадовільно");
}
