/*
// Виведення чисел від 1 до 10 БЕЗ ЦИКЛІВ
console.log(1);
console.log(2);
console.log(3);
console.log(4);
console.log(5);
console.log(6);
console.log(7);
console.log(8);
console.log(9);
console.log(10);
*/

let i = 1;

// поки умова виконується
// будемо повторювати код (набір інструкцій)
// в середині блоку (між { і })
while (i <= 10) {
  // початок блоку
  console.log(i);

  // забезпечуємо вихід з циклу
  // щоб умова змогла стати хибною
  // інакше блок буде повторюватися вічно
  // і доведеться перезавантажувати комп'ютер
  i = i + 1; // i += 1;
  // кінець блоку
}

/*
крок 1: оголосили змінну і й присвоїли значення 1
крок 2: зустріли цикл while
крок 3: перевіряємо умову while: (i <= 10)
крок 4: якщо умова хибна - пропускаємо блок коду while і рухаємось далі
крок 5: якщо умова істинна (1 <= 10) - переходимо до виконання блоку коду між { і }
крок 5.1: виводимо у консоль поточне значення змінної і
крок 5.2: збільшуємо значення змінної і щоб забезпечити вихід з циклу, тепер і = 2
крок 5.3: зустрічаємо кінець блоку коду (символ }) і повертаємося до перевірки умови
крок 6: перевіряємо умову while: (і <= 10)
крок 7: умова істинна (2 <= 10) - переходимо до виконання блоку коду між { і }
крок 7.1: виводимо у консоль поточне значення змінної і
крок 7.2: збільшуємо значення змінної і щоб забезпечити вихід з циклу, тепер і = 3
крок 7.3: зустрічаємо кінець блоку коду (символ }) і повертаємося до перевірки умови
...
крок 9: перевіряємо умову while: (і <= 10)
крок 10: умова істинна (10 <= 10) - переходимо до виконання блоку коду між { і }
крок 10.1: виводимо у консоль поточне значення змінної і
крок 10.2: збільшуємо значення змінної і щоб забезпечити вихід з циклу, тепер і = 11
крок 10.3: зустрічаємо кінець блоку коду (символ }) і повертаємося до перевірки умови
крок 11: перевіряємо умову while: (і <= 10)
крок 12: якщо умова хибна - пропускаємо блок коду while і рухаємось далі
*/

let paragraf = 1;

// поки не опрацюєш 5 параграфів не підеш гуляти
while (paragraf <= 5) {
  // прочитати
  // виписати терміни
  // дати відповіді на питання в кінці
  // перейти до наступного параграфу

  paragraf += 1;
}

// піти гуляти

console.log("Приклад роботи циклу while, якщо умова не виконується");

let j = 40;

while (j <= 10) {
  console.log(j);
  j += 1;
}

console.log("Кінець прикладу роботи циклу while, якщо умова не виконується");

// Гра
// Вгадати число, яке загадав комп'ютер від 0 до 10 +
// Повторювати запит користувачу допоки не вгадає,
// або не натисне кнопку Скасувати +

// Math.random() --> від 0 до 1 [0, 1) --> 0.6544212542221
// 0.6544212542221 * 10  = 6.544212542221
// Math.round(10 * 0.65442125422211) = 7
const compNumber = Math.round(10 * Math.random());

console.log(`Число комп'ютера:`, compNumber);

let userNumber = -1; // тому що не входить в діапазон від 0 до 10

// на 1 кроці, умова буде завжди істинною
// щоб точно хоча б 1 раз зайти в блок while
while (compNumber !== userNumber) {
  const userAnswer = prompt(
    "Введіть число від 0 до 10 або натисніть кнопку Скасувати щоб завершити гру"
  );

  console.log(`Відповідь користувача:`, userAnswer);

  // Якщо користувач натиснув Скасувати - виходимо з циклу
  // і завершуємо гру
  if (userAnswer === null) {
    alert("Гру скасовано");
    break; // примусовий вихід з циклу
  }

  userNumber = Number(userAnswer); // конвертуємо "7" в число 7

  console.log(`Число користувача:`, userNumber);

  if (Number.isNaN(userNumber)) {
    alert("Ви ввели не число, повторіть спробу");
    continue; // зупиняє роботу циклу на поточному кроці
    // і починає нове (наступне) коло циклу
    // з перевірки умови while (compNumber !== userNumber)
  }

  if (userNumber === compNumber) {
    alert("Вітаємо з перемогою! Удача на вашому боці!");
  } else if (userNumber > compNumber) {
    alert("Забагато");
  } else {
    // userNumber < compNumber
    alert("Замало");
  }
}

// Спрощена версія гри для демонстрації альтернативного підходу
const compNumber2 = 2;

console.log("-------------------------------------");
console.log("Спрощений приклад");
console.log("-------------------------------------");

// на 1 кроці, умова буде завжди істинною
// щоб точно хоча б 1 раз зайти в блок while
while (true) {
  const userNumber2 = Number(
    prompt("Введіть число від 0 до 10 або 2 щоб завершити гру")
  );

  // тут мали бути перевірки

  if (userNumber2 === compNumber2) {
    console.log("Вітаємо з перемогою! Удача на вашому боці!");
    break; // примусовий вихід з циклу
  } else if (userNumber2 > compNumber2) {
    console.log("Забагато");
  } else {
    // userNumber < compNumber
    console.log("Замало");
  }
}

console.log("-------------------------------------");
