<?php
for ($i = 1; $i <= 10; $i++) {
    echo " $i ";
}
echo "<br>";

// Вивести 10 випадкових чисел
for ($i = 1; $i <= 10; $i++) {
    echo rand(1, 20) . ", ";
}
echo "<br><br>";


$num = 1;
while ($num < 20) {
    echo "$num, ";
    $num += 2;
}

// Порахувати суму чисел від 15 до 24
$suma = 0;
$i = 15;
while ($i <= 24) {
    $suma += $i;
    $i++;
}
echo "<br>Suma (15-24): $suma";
echo "<br><br>";

// Згенерувати набір випадкових чисел в межах від 1 до 40.
// Зупинити цикл якщо випаде число більше 25
do {
    $random = rand(1, 40);
    echo "$random, ";
} while ($random <= 25);
echo "<br>";
// break - перериває роботу циклу та виконується код після/за циклу нижче
// continue - перериває поточний виток циклу та відразу переходить до наступного 

// Згенерувати набір з 20 випадкових чисел в межах від 1 до 40.
// Зупинити цикл раніше якщо випаде число більше рівне 35 (break)
// Якщо випаде парне число - не виводити його (continue)
$count_continue = 0;
for ($i = 1; $i <= 20; $i++) {
    $random = rand(1, 40);
    if ($random % 2 == 0) {
        $count_continue++;
        continue;
    }
    echo "$random, ";
    if ($random >= 35) {
        break;
    }
}
echo "<br>Кількість пропусків: $count_continue";
