// Попросити користувача ввести число від 1 до 20. +
// Якщо користувач введе не число, +
// або число за межами вказаного діапазону, +
// то повідомити про помилку. +
// Якщо користувач натисне Скасувати, +
// то подякувати за участь і попрощатися. +

const answer = prompt("Введіть число від 1 до 20", 10);

if (answer === null) {
  console.log("Дякую за Ваш час. Всього доброго");
} else {
  const number = Number(answer);

  // Перевіряємо чи користувач ввів число,
  // якщо ввів не число (літери, розділові знаки тощо),
  // то перетворення рядка в число Number(answer) поверне NaN
  // тому перевіряємо..
  //   if (isNaN(number)) {
  // або
  //   if (Number.isNaN(number)) {

  // Спосіб 1
  if (Number.isNaN(number)) {
    console.log("Введіть число. Ви ввели не число");
  } else if (number < 1 || number > 20) {
    console.log("Введіть число від 1 до 20. Ви ввели:", number);
  } else {
    console.log(`Дякуємо! Ви отримали +${number} балів в карму!`);
  }

  // Спосіб 2
  if (Number.isNaN(number)) {
    console.log("Введіть число. Ви ввели не число");
  } else if (number >= 1 && number <= 20) {
    console.log(`Дякуємо! Ви отримали +${number} балів в карму!`);
  } else {
    console.log("Введіть число від 1 до 20. Ви ввели:", number);
  }

  // Спосіб 3
  if (Number.isNaN(number) || number < 1 || number > 20) {
    console.log(
      "Перевірте правильність введення даних. Ви ввели або не число, або число виходить за межі діапазону від 1 до 20"
    );
  } else {
    console.log(`Дякуємо! Ви отримали +${number} балів в карму!`);
  }
}
