// 1. Вивести числа від 3 до 15.
console.log("------ Завдання 1 ------");

let i = 3;

while (i <= 15) {
  console.log(i);

  i = i + 1; // i += 1
}

// 2. Вивести парні числа від 2 до 20.
console.log("------ Завдання 2 ------");

let j = 2;

while (j <= 20) {
  console.log(j);

  j = j + 2;
}

console.log("------------------------");

j = 2; // необхідно через те, що після попереднього способу значення j було 22

while (j <= 20) {
  if (j % 2 === 0) {
    console.log(j);
  }

  j += 1;
}

// 3. Знайти суму чисел від 1 до n
// - Користувач вводить число n. +
// - Порахувати суму чисел від 1 до n. +
console.log("------ Завдання 3 ------");

const n = Number(
  prompt("Введіть число для підрахунку суми від 1 до вказаного числа", 5)
);

let sum3 = 0;
let k = 1;

while (k <= n) {
  sum3 = sum3 + k;

  k = k + 1;
}

console.log(`Сума чисел від 1 до ${n} =`, sum3);

// 4. Порахувати кількість чисел, які діляться на 3
// - Виведіть кількість чисел від 1 до 50, які діляться на 3 без залишку.
console.log("------ Завдання 4 ------");

let m = 1;
let count = 0;

while (m <= 50) {
  if (m % 3 === 0) {
    count = count + 1; // умовно, загнув пальчик
  }

  m = m + 1;
}

console.log(
  "Кількість чисел від 1 до 50, які діляться на 3 без залишку:",
  count
);

// 5. Перевірка пароля
// - Задати правильний пароль +
// - Давати користувачу 3 спроби для введення +
// - При правильному введенні вивести "Доступ надано" +
// - Після третьої невдалої спроби вивести "Доступ заблоковано" +
console.log("------ Завдання 5 ------");

const correctPass = "qwerty";

let userPass;
let userTry = 0;

do {
  userPass = prompt("Введіть пароль");

  console.log(`Відповідь користувача:`, userPass);

  // Якщо користувач натиснув Скасувати - виходимо з циклу
  if (userPass === null) {
    break; // примусовий вихід з циклу
  }

  userTry = userTry + 1; // зараховуємо спробу введення пароля, оскільки не натиснув Скасувати

  if (userPass === correctPass) {
    alert("Доступ надано");
  } else if (userTry >= 3) {
    alert("Доступ заблоковано");
    break;
  }
} while (userPass !== correctPass);

// 6. Накопичення суми
// - Користувач вводить числа +
// - Програма додає їх до загальної суми +
// - Введення продовжується поки користувач не введе 0 +
// - Вивести кінцеву суму та кількість введених чисел +
console.log("------ Завдання 6 ------");

let sum6 = 0;
let count6 = 0;

while (true) {
  const userNumber = Number(prompt("Введіть число або 0 щоб завершити"));

  if (Number.isNaN(userNumber)) {
    alert("Помилка. Ввели не число");
    continue;
  }

  if (userNumber === 0) {
    break;
  }

  sum6 += userNumber; // sum6 = sum6 + userNumber;
  count6 += 1; // count6 = count6 + 1

  console.log("sum6 =", sum6, "count6 =", count6);
}

console.log(
  `Сума введених чисел: ${sum6}, кількість введених чисел: ${count6}`
);

// 7. Таблиця множення
// - Ввести число N +
// - Вивести таблицю множення для цього числа (від 1 до 10)
// - Результат оформити у вигляді таблиці `${2} x ${3} = ${6}`.
console.log("------ Завдання 7 ------");

const N = Number(prompt("Введіть число", 2));

let o = 1;

while (o <= 10) {
  console.log(`${N} x ${o} = ${N * o}`);

  o += 1; // o = o + 1
}

// 8* Пошук дільників числа
// - Ввести додатне число +
// - Знайти всі числа, на які воно ділиться без остачі +
// - Вивести список всіх дільників +
console.log("------ Завдання 8 ------");

const positiveNumber = Number(prompt("Введіть додатне число", 12));

let q = 1;

console.log(`Всі числа, на які ${positiveNumber} ділиться без остачі:`);

while (q <= positiveNumber) {
  if (positiveNumber % q === 0) {
    console.log(q);
  }

  q += 1;
}

// 9*** Числа Фібоначчі
// (Послідовність чисел, у якій кожне наступне число є сумою двох попередніх:
// 0,1,1,2,3,5,8,13…)
// - Ввести кількість чисел N.
// - Вивести перші N чисел послідовності (перші 2 числа оголошуються вручну, решту – за допомогою циклу).
console.log("------ Завдання 9 ------");

const fibCount = Number(
  prompt("Введіть кількість чисел послідовності Фібоначчі", 8)
);

let r = 3;

console.log(`Перші ${fibCount} чисел послідовності Фібоначчі:`);

let a = 0; // 1й елемент
let b = 1; // 2й елемент

console.log(a);
console.log(b);

while (r <= fibCount) {
  const next = a + b;

  console.log(next);

  a = b;
  b = next;

  r += 1;
}
